local function run (msg , matches)
if matches[1]:lower() == "الاوامر" or matches[1] == 'help' and is_sudo and owner and admin(msg) then
if not lang then
text = [[
📍 اهــلا بك عــزيزي هنــاك 4 قوائم ليتم عرضها 
〰〰〰〰〰〰〰〰〰〰〰

✞- م1  «لعــرض قائمــﮭه القفل+الفتح»

✞- م2  «لعــرض قائمــﮭه الرفع+التنزيل»

✞- م3  «لعــرض قائمــﮭه الحضر+الطرد»

✞- م4  «لعــرض قائمــهه المطورين»

✞- م5  «لعــرض الاوامر الخدميه»

〰〰〰〰〰〰〰〰〰〰〰 
 
 ;)]]

elseif lang then

text = [[
📍 اهــلا بك عــزيزي هنــاك 4 قوائم ليتم عرضها 
〰〰〰〰〰〰〰〰〰〰〰

✞- م1  «لعــرض قائمــﮭه القفل+الفتح»

✞- م2  «لعــرض قائمــﮭه الرفع+التنزيل»

✞- م3  «لعــرض قائمــﮭه الحضر+الطرد»

✞- م4  «لعــرض قائمــهه المطورين»

✞- م5  «لعــرض الاوامر الخدميه»

〰〰〰〰〰〰〰〰〰〰〰 
 
  ;)]]
end
return text
end
-----------------------------------------
if matches[1] == 'م1' and is_mod(msg) then
if not lang then
lock = "Group name:"..msg.to.title..[[
━━━ 🔐 اوامر القفل والفتح ⏬ ━━━
  ❦ <الاوامر>

 ◇ 【  قفل  】 ⬅ + الامر 🎗 ┇

 ◆ 〖  فتح  〗⬅ + الامر  🎗 ┇
__________________

● ◄                          التثبيت 📠
__________________

● ◄                          الكلايش 📝
__________________

● ◄                          التكرار ♻
__________________

● ◄                          الجهات 📲    
__________________    

● ◄                          الكل 🔧
__________________

● ◄                          التاك 🎐
__________________

● ◄                          الاضافه 💈
__________________

● ◄                          الروابط 🎌
__________________

● ◄                          البوتات 🤖
__________________

● ◄                          الفيديو 📹
__________________

● ◄                          الملصقات 🎄
__________________

● ◄                          الصور 📷   
__________________    

● ◄                          التوجيه ➰
__________________

● ◄                          التعديل  ✐ 
__________________

● ◄                          الصوت 🗣
__________________

● ◄                          الدردشه 💭
__________________

●◄                           المتحركه 🎉
__________________

● ◄                          الملفات 📚
__________________

● ◄                          الاغاني 🎸
__________________

● ◄                          المواقع 🌍
__________________

● ◄                          الاشعارات 📩
__________________

● ◄                          الماركداون 💹
__________________

🔱 [~ <help> ~] 🔱


 MSG BY :]]..msg.from.first_name

elseif lang then

lock = "Group name:"..msg.to.title..[[
l━━━ 🔐 اوامر القفل والفتح ⏬ ━━━
 ❦ <الاوامر>
 ◇ 【  قفل  】 ⬅ + الامر 🎗 ┇

 ◆ 〖  فتح  〗⬅ + الامر  🎗 ┇
__________________

● ◄                          التثبيت 📠
__________________

● ◄                          الكلايش 📝
__________________

● ◄                          التكرار ♻
__________________

● ◄                          الجهات 📲    
__________________    

● ◄                          الكل 🔧
__________________

● ◄                          التاك 🎐
__________________

● ◄                          الاضافه 💈
__________________

● ◄                          الروابط 🎌
__________________

● ◄                          البوتات 🤖
__________________

● ◄                          الفيديو 📹
__________________

● ◄                          الملصقات 🎄
__________________

● ◄                          الصور 📷   
__________________    

● ◄                          التوجيه ➰
__________________

● ◄                          التعديل  ✐ 
__________________

● ◄                          الصوت 🗣
__________________

● ◄                          الدردشه 💭
__________________

●◄                           المتحركه 🎉
__________________

● ◄                          الملفات 📚
__________________

● ◄                          الاغاني 🎸
__________________

● ◄                          المواقع 🌍
__________________

● ◄                          الاشعارات 📩
__________________

● ◄                          الماركداون 💹
__________________

🔱 [~ <help> ~] 🔱


 MSG BY :]]..msg.from.first_name
end
return lock
end
-----------------------------------------
if matches[1] == 'م2' and is_mod(msg) then
if not lang then
lock2 = "Group name:"..msg.to.title..[[

🏴▫▫▫▫▫▫▫▫▫🏳

🕵‍♀اهلا بك عــزيزي في اوامــر الحــظر والطــرد :

ّ ⚌⚌⚌⚌⚌⚌⚌⚌ ٴ
🎗 ┇{الحظــر } :

🎐 = {حظر} :  【 ꪜ 】

🎐= {الغاء حظر} 【✘】

🎐 = {المحظورين} :➰📄

🎐= {مسح المحظورين} :📝

⚌⚌⚌⚌⚌⚌⚌⚌ٴ
🎗 ┇{لطــرد العــضو} :

🗑 = {طرد} :🚶

⚌⚌⚌⚌⚌⚌⚌⚌ٴ
🎗 ┇{العام} :

📍 = {حظر عام} : 【 ꪜ 】

📍 = {الغاء العام 【✘】

📍 = {قائمه العام} ♨

📍= {مسح قائمه العام} ☒

⚌⚌⚌⚌⚌⚌⚌⚌ ٴ
 🎗 ┇{قائمــﮭه المنــع} :

🕆 = {منع} : 【 ꪜ 】

🕆 = {الغاء منع} : 【✘】

🕆 = {مسح قائمه المنع} 📝

⚌⚌⚌⚌⚌⚌⚌⚌ ٴ
 🎗 ┇{قائمــﮭه المكتومين} :

🕇 = {كتم} :🔇

🕇 = {الغاء الكتم} :🔊

🕇 = {المكتومين}🔕📄

🕇 = {مسح المكتومين}🔊📝

⚌⚌⚌⚌⚌⚌⚌⚌ ٴ

🔱 ~ <b>HELL</b> ~ 🔱

»  🚩 〰〰〰  🚩 «
🔸➖➖➖➖➖➖➖➖➖🔸

 MSG BY :]]..msg.from.first_name

elseif lang then

lock2 = "Group name:"..msg.to.title..[[

🏴▫▫▫▫▫▫▫▫▫🏳

🕵‍♀اهلا بك عــزيزي في اوامــر الحــظر والطــرد :

ّ ⚌⚌⚌⚌⚌⚌⚌⚌ ٴ
🎗 ┇{الحظــر } :

🎐 = {حظر} :  【 ꪜ 】

🎐= {الغاء حظر} 【✘】

🎐 = {المحظورين} :➰📄

🎐= {مسح المحظورين} :📝

⚌⚌⚌⚌⚌⚌⚌⚌ٴ
🎗 ┇{لطــرد العــضو} :

🗑 = {طرد} :🚶

⚌⚌⚌⚌⚌⚌⚌⚌ٴ
🎗 ┇{العام} :

📍 = {حظر عام} : 【 ꪜ 】

📍 = {الغاء العام 【✘】

📍 = {قائمه العام} ♨

📍= {مسح قائمه العام} ☒

⚌⚌⚌⚌⚌⚌⚌⚌ ٴ
 🎗 ┇{قائمــﮭه المنــع} :

🕆 = {منع} : 【 ꪜ 】

🕆 = {الغاء منع} : 【✘】

🕆 = {مسح قائمه المنع} 📝

⚌⚌⚌⚌⚌⚌⚌⚌ ٴ
 🎗 ┇{قائمــﮭه المكتومين} :

🕇 = {كتم} :🔇

🕇 = {الغاء الكتم} :🔊

🕇 = {المكتومين}🔕📄

🕇 = {مسح المكتومين}🔊📝

⚌⚌⚌⚌⚌⚌⚌⚌ ٴ

🔱 ~ <b>HELL</b> ~ 🔱

»  🚩 〰〰〰  🚩 «
🔸➖➖➖➖➖➖➖➖➖🔸

 MSG BY :]]..msg.from.first_name
end
return lock2
end
-----------------------------------------
if matches[1]:lower() == "h2" or matches[1] == 'م3' and is_mod(msg) then
if not lang then
lock2 = "Group name:"..msg.to.title..[[
~🚩 اهلا بك في اوامر الادمنيه  🚩~

~~~~~~~~~~~~~~~~~~~

✿┇ ◄ تثبيت  〰   بالرد 

✿┇ ◄ الغاء تثبيت 〰 بالرد 

✿┇ ◄ ضع صوره           

✿┇ ◄ حذف صوره

--------------------------------------

✿┇ ◄ضع رابط   || ثم ارسل الرابط ||


✿┇ ◄ضع قوانين  || النص ||    
   

✿┇ ◄ضع وصف   || النص ||

       
✿┇ ◄ضع ترحيب || النص ||


✿┇ ◄ضع اسم     || النص ||     

--------------------------------------

●┇◄ امسح  〰  الامر ادناه ↓

✵┇◄ المحظورين   ❂  المكتومين   ❂  قائمه العام

✵┇◄ قائمه المنع  ❂  الادمنيه  ❂  المدراء

✵┇◄ الوصف  ❂  القوانين  ❂  الترحيب

--------------------------------------
✵┇◄ الترحيب

✵┇◄ تفعيل // تعطيل 

✵┇◄ المحظورين

✵┇◄ المكتومين

✵┇◄ قائمه المنع

✵┇◄ الادمنيه 

✵┇◄ المدراء

✵┇◄ الوصف 

✵┇◄ القوانين

✵┇◄ الترحيب

✵┇◄ ️ضع ترحيب || النص ||

〰〰〰〰〰〰〰〰〰〰〰

 ❦ <اتمنى التوفيق للجميع >🎐
 MSG BY :]]..msg.from.first_name

elseif lang then

lock2 = "Group name:"..msg.to.title..[[

~🚩 اهلا بك في اوامر الادمنيه  🚩~

~~~~~~~~~~~~~~~~~~~

✿┇ ◄ تثبيت  〰   بالرد 

✿┇ ◄ الغاء تثبيت 〰 بالرد 

✿┇ ◄ ضع صوره           

✿┇ ◄ حذف صوره

--------------------------------------

✿┇ ◄ضع رابط   || ثم ارسل الرابط ||


✿┇ ◄ضع قوانين  || النص ||    
   

✿┇ ◄ضع وصف   || النص ||

       
✿┇ ◄ضع ترحيب || النص ||


✿┇ ◄ضع اسم     || النص ||     

--------------------------------------

●┇◄ امسح  〰  الامر ادناه ↓

✵┇◄ المحظورين   ❂  المكتومين   ❂  قائمه العام

✵┇◄ قائمه المنع  ❂  الادمنيه  ❂  المدراء

✵┇◄ الوصف  ❂  القوانين  ❂  الترحيب

--------------------------------------
✵┇◄ الترحيب

✵┇◄ تفعيل // تعطيل 

✵┇◄ المحظورين

✵┇◄ المكتومين

✵┇◄ قائمه المنع

✵┇◄ الادمنيه 

✵┇◄ المدراء

✵┇◄ الوصف 

✵┇◄ القوانين

✵┇◄ الترحيب

✵┇◄ ️ضع ترحيب || النص ||

〰〰〰〰〰〰〰〰〰〰〰

 ❦ <اتمنى التوفيق للجميع >🎐
 MSG BY :]]..msg.from.first_name
end
return lock2
end
-----------------------------------------
if matches[1]:lower() == "h2" or matches[1] == 'م4' and is_mod(msg) then
if not lang then
lock2 = "Group name:"..msg.to.title..[[
꧁🛡 اهلا بك في اوامر المطور 🛠 ꧂

   ◢  〰〰〰〰〰〰〰◣


✯┇ تفعيل  ⇦  ➰| لتفعيل المجموعه |【 ꪜ 】

 ✯┇ تعطيل ⇦  ➰| لتعطيل المجموعه |【✘】

  ═══════════
 
 ✯┇  رفع مدير.  ⇦ لرفع مدير  【 ꪜ 】

 ✯┇ تنزيل مدير ⇦ لتنزيل مدير【✘】

 ✯┇ رفع اداري   ⇦  لرفع اداري 【 ꪜ 】

 ✯┇تنزيل اداري ⇦ لتنزيل اداري【✘】

✯┇ رفع ادمن   ⇦  لرفع ادمن 【 ꪜ 】

 ✯┇تنزيل ادمن ⇦ لتنزيل ادمن【✘】

 ✯┇ اضف مطور ⇚   بالرد 【 ꪜ 】

 ✯┇ حذف مطور ⇚  بالرد. 【✘】

  ════════════

🎐 ┇ اذاعه ◁ اذاعه + الكلام. 【 ꪜ 】

🎐 ┇ رساله  ⇦   + ايدي المجموعه【 ꪜ 】

🎐 ┇ مغادر ◁    لمغادره البوت【 ꪜ 】

  ════════════

 ✞┇المغادره تلقائيا ⇦    تفعيل 【 ꪜ 】

 ✞┇المغادره تلقائيا ⇦ تعطيل. 【✘ 】

✞┇تنظيف ◁  مسح + العدد لل100 فقط 🛡

✞┇المجموعات ⇦ لعرض مجموعات البوت 🛡

〰〰〰〰〰〰〰〰
❦ <اتمنى لكم التوفيق 🌝 >


MSG BY :]]..msg.from.first_name

elseif lang then

lock2 = "Group name:"..msg.to.title..[[

text = [[
 ꧁🛡 اهلا بك في اوامر المطور 🛠 ꧂

   ◢  〰〰〰〰〰〰〰◣


✯┇ تفعيل  ⇦  ➰| لتفعيل المجموعه |【 ꪜ 】

 ✯┇ تعطيل ⇦  ➰| لتعطيل المجموعه |【✘】

  ═══════════
 
 ✯┇  رفع مدير.  ⇦ لرفع مدير  【 ꪜ 】

 ✯┇ تنزيل مدير ⇦ لتنزيل مدير【✘】

 ✯┇ رفع اداري   ⇦  لرفع اداري 【 ꪜ 】

 ✯┇تنزيل اداري ⇦ لتنزيل اداري【✘】

✯┇ رفع ادمن   ⇦  لرفع ادمن 【 ꪜ 】

 ✯┇تنزيل ادمن ⇦ لتنزيل ادمن【✘】

 ✯┇ اضف مطور ⇚   بالرد 【 ꪜ 】

 ✯┇ حذف مطور ⇚  بالرد. 【✘】

  ════════════

🎐 ┇ اذاعه ◁ اذاعه + الكلام. 【 ꪜ 】

🎐 ┇ رساله  ⇦   + ايدي المجموعه【 ꪜ 】

🎐 ┇ مغادر ◁    لمغادره البوت【 ꪜ 】

  ════════════

 ✞┇المغادره تلقائيا ⇦    تفعيل 【 ꪜ 】

 ✞┇المغادره تلقائيا ⇦ تعطيل. 【✘ 】

✞┇تنظيف ◁  مسح + العدد لل100 فقط 🛡

✞┇المجموعات ⇦ لعرض مجموعات البوت 🛡

〰〰〰〰〰〰〰〰
❦ <اتمنى لكم التوفيق 🌝 >


 MSG BY :]]..msg.from.first_name
end
return lock2
end
if matches[1] == "المطور" or matches[1] == "مطور" or matches[1] == "XX8" or matches[1] == "اريد بوت" and is_mod(msg) then
    local text = [[
مطور ســورس |¶ = XX8 = |¶


المطور 🎐
 ↓↓

♦️ @US_KASPERK5 🚴


〰〰〰〰〰〰〰〰〰〰〰
]]
    return text
  end
end


return {
patterns ={
"^([Hh]elp)$",
"^([Hh]1)$",
"^([Hh]2)$",
"^([Hh]3)$",
"^([Hh]4)$",
"^(الاوامر)$",
"^(م1)$",
"^(م2)$",
"^(م3)$",
"^(م4)$",
"^(المطور)$",
 "^(مطور)$",
 "^(اريد بوت)$",
"^(XX8)$",
"^(السورس)$",
 "^(الاصدار)$",
 "^(سورس)$",
"^(يا سورس)$",
"^(اريد سورس)$",
}, 
run =run
}